#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 03b: Datentypen & Deklarationen
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXIV}{C++14\xspace}
#+LATEX: \newcommand{\cppXI}{C++11\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Initialisierung -- \cpp{}17
\vspace*{2em}
In "neuen" Compilerversionen auch bei \cpp11 und \cpp14!\newline
\hspace*{2em} \to auf Empfehlung des Standardkomitees!!
#+header: :exports both :results output :tangle src/cpp17.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>
#include <initializer_list>

using namespace std;

int main() {
    auto a={1, 2, 3};  // initializer_list<int>
    for (auto e : a) cout << e << ' ';
    auto b={4};
    for (auto e : b) cout << e << ' ';
    auto c{42};
    cout << c << endl;
    // auto d{1, 2, 3};  // error!
}
#+end_src

#+RESULTS:
: 1 2 3 4 42

* Initialisierung -- 3
\vspace{1.5em}
\footnotesize
#+header: :exports code :results output :tangle src/init2.cpp
#+BEGIN_SRC C++
#include <iostream>
#include <mutex>
#include <typeinfo>
using namespace std;

mutex mtx;
int main() {
  cout << typeid(mtx).name() << endl;  // -> St5mutex
  {
    // new unique_lock named mtx
    unique_lock<mutex>(mtx);  // -> St11unique_lockISt5mutexE
    cout << typeid(mtx).name() << endl;
    // using mtx as mutex will appear the bug
  }
  {
    // temp object initialized with mtx!
    unique_lock<mutex>{mtx};  // -> St5mutex
    cout << typeid(mtx).name() << endl;
    // using mtx as unique_lock will appear the bug
  } }
#+END_SRC

#+RESULTS:
: St5mutex
: St11unique_lockISt5mutexE
: St5mutex

